---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextStyleFont
source: html/345a74f6-5059-54c6-1386-f833f4a631f4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextStyleFont Property

"Font"

## Syntax (C#)
```csharp
public static ForgeTypeId TextStyleFont { get; }
```